app/Http/Controllers/BeaController.php

select * from `kode_dok`
---
    public function index()
    {

        $title = 'Bea Cukai Docs';

        $dok = KodeDok::all();