app/Http/Controllers/Gati.php

    public function index_rec()
    {
        $title = 'Gate In Recivng';
        $confirmed = Item::where('ctr_intern_status', '=', 50,)->orderBy('truck_in_date', 'desc')->get();
---
select * from `item` where `ctr_intern_status` = 50 order by `truck_in_date` desc

                'container_key' => $tem->container_key
            ];
        }
        $containerKeys = Item::where('ctr_intern_status', '49')
            ->pluck('container_no', 'container_key');
        $users = User::all();
---
select `container_no`, `container_key` from `item` where `ctr_intern_status` = '49'
select * from `users`

        $yard_tier = Yard::distinct('yard_tier')->pluck('yard_tier');
        $currentDateTime = Carbon::now();
        $currentDateTimeString = $currentDateTime->format('Y-m-d H:i:s');
        $isocode = Isocode::all();
---
select * from `isocode`