app/Http/Controllers/HomeController.php

select * from `history_container` order by `update_time` desc limit 3
---
    public function index()
    {
        $title = 'Admin Dashboard';
        $vessel_voyage = VVoyage::orderBy('etd_date', 'desc')->take(3)->get();
        $history_container = HistoryContainer::orderBy('update_time', 'desc')->take(3)->get();