app/Http/Controllers/LoadController.php

    public function index()
    {
      $title = 'Confirm Load';
      $subtitle = 'Discharge Load';
      $confirmed = Item::where('ctr_intern_status', '=', 56,)->orderBy('update_time', 'desc')->get();
---
select * from `item` where `ctr_intern_status` = 56 order by `update_time` desc

          'container_key' => $tem->container_key
        ];
      }
      $items = Item::where('ctr_intern_status', '=', [51, 53])->get();
      $users = User::all();
---
select * from `item` where `ctr_intern_status` = 51
select * from `users`

    public function get_cont(request $request)
    {
      $ves_id = $request->ves_id;
      $container_key = Item::where('ves_id', $ves_id)->where('ctr_intern_status', '=', [51, 53])->get();
---
select * from `item` where `ves_id` = '18' and `ctr_intern_status` = 51

    public function get_key(Request $request)
    {
      $container_key = $request->container_key;
      $name = Item::where('container_key', $container_key)->first();
---
select * from `item` where `container_key` = '2572' limit 1

    public function confirm(Request $request)
    {
      $container_key = $request->container_key;
      $item = Item::where('container_key', $container_key)->first();
      $request->validate([
        'container_no' => 'required',
        'cc_tt_no' => 'required',
        'cc_tt_oper' => 'required',
        'bay_slot' => 'required',
        'bay_row' => 'required',
        'bay_tier' => 'required',

      ], [
        'container_no.required' => 'Container Number is required.',
        'cc_tt_no.required' => 'Nomor Alat Number is required.',
        'cc_tt_oper.required' => 'Operator Alat Number is required.',
      ]);
      Item::where('container_key', $container_key)->update([
        'bay_slot' => $request->bay_slot,
        'bay_row' => $request->bay_row,
        'bay_tier' => $request->bay_tier,


      ]);
---
select * from `item` where `container_key` = '2574' limit 1
update `item` set `bay_slot` = 'A1', `bay_row` = '1', `bay_tier` = '3', `load_date` = '2023-08-16T15:14', `cc_tt_no` = '123', `cc_tt_oper` = 'andi', `ctr_intern_status` = '56' where `container_key` = '2574'