app/Http/Controllers/PlacementController.php

select * from `item` where `ctr_intern_status` in (3, 4, 51) order by `update_time` desc
---
    public function index()
    {
        $title = 'PLC';
        $confirmed = Item::whereIn('ctr_intern_status',  [03, 04, 51])->orderBy('update_time', 'desc')->get();

select * from `item` where `ctr_intern_status` in (2, 3, 4, 50, 51)
select * from `users`
---
                'ctr_intern_status' => $tem->ctr_intern_status
            ];
        }
        $items = Item::whereIn('ctr_intern_status', [02, 03, 04, 50, 51])->get();
        $users = User::all();