app/Http/Controllers/Stuffing.php

select * from `item` where `ctr_intern_status` = 53 order by `update_time` desc
---
    public function index()
    {
        $title = 'Stuffing';
        $confirmed = Item::where('ctr_intern_status', '=', 53,)->orderBy('update_time', 'desc')->get();

select `container_no`, `container_key` from `item` where `ctr_intern_status` = '04'
select * from `item` where `ctr_intern_status` = 4
select * from `users`
---
                'container_key' => $tem->container_key
            ];
        }
        $containerKeys = Item::where('ctr_intern_status', '=', '04')
            ->pluck('container_no', 'container_key');
        $items = Item::where('ctr_intern_status', 04)->get();
        $users = User::all();

select * from `item` where `container_key` = '2591' limit 1
---
    public function get_stuffing(Request $request)
    {
        // $client = new Client();
        $container_key = $request->container_key;
        $name = Item::where('container_key', $container_key)->first();