app/Http/Controllers/VesselController.php

    public function create()
    {
        $title = 'Add Schedule';
       $users = User::all();
       $vessel_master = VMaster::all();
       $vessel_seq = VSeq::all();
       $vessel_service = VService::select('service')->distinct()->get();
       $berth = Berth::all();
---
select * from `users`
select * from `berth`