app/Http/Controllers/YardrotController.php

select `yard_rowtier`.`yard_row`, `yard_rowtier`.`yard_tier`, `yard_rowtier`.`container_key`, `yard_rowtier`.`container_no`, `item`.`load_port`, `item`.`disch_port`, `item`.`iso_code`, `ctr_type`, `gross`, `gross_class` from `yard_rowtier` inner join `item` on `item`.`container_key` = `yard_rowtier`.`container_key` and `item`.`container_no` = `yard_rowtier`.`container_no` where `yard_rowtier`.`YARD_BLOCK` = 'A1' and `yard_rowtier`.`YARD_SLOT` = '5' order by `yard_rowtier`.`YARD_TIER` asc, `yard_rowtier`.`YARD_ROW` asc
---
    private function get_rtdisp($block_no, $slot_no)
    {
        $lt_rowtier = YardRot::select('yard_rowtier.yard_row', 'yard_rowtier.yard_tier', 'yard_rowtier.container_key', 'yard_rowtier.container_no', 'item.load_port', 'item.disch_port', 'item.iso_code', 'ctr_type', 'gross', 'gross_class')->join('item', function ($join) {
            $join->on('item.container_key', '=', 'yard_rowtier.container_key');
            $join->on('item.container_no', '=', 'yard_rowtier.container_no');
        })
            ->where('yard_rowtier.YARD_BLOCK', '=', $block_no)
            ->where('yard_rowtier.YARD_SLOT', '=', $slot_no)
            ->orderBy('yard_rowtier.YARD_TIER', 'asc')
            ->orderBy('yard_rowtier.YARD_ROW', 'asc')
            ->get();